app/controllers/carts_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 4
SELECT `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`order_id` = 4
---
  def show
    @order_items = current_order.order_items
	@current_order = current_order
	#@promotions = OrderPromotion.find(:all, :conditions => ["order_id = ?", current_order.id])
	@promotions = OrderPromotion.where(order_id: current_order.id).to_a