app/controllers/order_items_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5
INSERT INTO `order_items` (`quantity`, `product_id`, `order_id`, `unit_price`, `total_price`, `created_at`, `updated_at`) VALUES (1, 3, 5, 99.99, 99.99, '2016-11-17 14:31:50', '2016-11-17 14:31:50')
INSERT INTO `orders` (`subtotal`, `total`, `created_at`, `updated_at`, `order_status_id`) VALUES (99.99, 99.99, '2016-11-17 14:31:50', '2016-11-17 14:31:50', 1)
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5 AND `order_items`.`id` = 15 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1
UPDATE `order_items` SET `quantity` = 3, `unit_price` = 21.67, `total_price` = 65.01, `updated_at` = '2016-11-17 15:13:26' WHERE `order_items`.`id` = 15
SELECT `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`order_id` = 5
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)
    @order_items = @order.order_items

	@promotions = OrderPromotion.where(order_id: current_order.id).to_a

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5 AND `order_items`.`id` = 8 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 5 LIMIT 1
DELETE FROM `order_items` WHERE `order_items`.`id` = 8
SELECT `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`order_id` = 5
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy
    @order_items = @order.order_items

	@promotions = OrderPromotion.where(order_id: current_order.id).to_a