app/controllers/order_promotions_controller.rb

SELECT `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`order_id` = 6
INSERT INTO `order_promotions` (`value`, `order_id`, `created_at`, `updated_at`) VALUES ('5%OFF', 4, '2016-11-17 14:08:26', '2016-11-17 14:08:26')
SELECT  `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`order_id` = 5 AND `order_promotions`.`value` = '5%OFF'  ORDER BY `order_promotions`.`id` ASC LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 4 LIMIT 1
SELECT  `promotions`.* FROM `promotions` WHERE `promotions`.`id` = 20 LIMIT 1
SELECT  `promotions`.* FROM `promotions` WHERE `promotions`.`name` = '5%OFF'  ORDER BY `promotions`.`id` ASC LIMIT 1
UPDATE `orders` SET `total_discount` = 20.0, `updated_at` = '2016-11-17 15:25:59' WHERE `orders`.`id` = 6
---
  def create
	@promotion = OrderPromotion.new(promotion_params)
	@promotion.order_id = current_order.id

	@order = current_order
	if @promotion.save

		@expromo = OrderPromotion.where(:order_id=>current_order.id, :value=>@promotion.value).first

		if @expromo.blank?
			flash[:notice] = 'Not a valid promo code.'
			redirect_to cart_path
		else

			#@promotions = OrderPromotion.where(order_id: current_order.id).to_a

			@promo = Promotion.where(:name => @promotion.value).first
			if @promo.promo_type == 'percent'
				@discount  = (@order.subtotal.to_s.to_d * @promo.value.to_s.to_d)/100
			else
				@discount  = @promo.value
			end

			@order.total_discount = (@order.total_discount+@discount).to_d
			@order.total  = @order.total - @discount
			@order.save

SELECT  `order_promotions`.* FROM `order_promotions` WHERE `order_promotions`.`id` = 16 LIMIT 1
DELETE FROM `order_promotions` WHERE `order_promotions`.`id` = 16
SELECT  `promotions`.* FROM `promotions` WHERE `promotions`.`name` = '20POUNDSOFF'  ORDER BY `promotions`.`id` ASC LIMIT 1
UPDATE `orders` SET `total_discount` = 22.5, `updated_at` = '2016-11-17 15:37:46' WHERE `orders`.`id` = 6
---
  def destroy
	@promotion = OrderPromotion.find(params[:id])

	@order = current_order
	if @promotion.destroy

		@promo = Promotion.where(:name => @promotion.value).first
		if @promo.promo_type == 'percent'
			@discount  = (@order.subtotal.to_s.to_d * @promo.value.to_s.to_d)/100
		else
			@discount  = @promo.value
		end

		@order.total_discount = (@order.total_discount-@discount).to_d
		@order.total  = @order.total + @discount
		@order.save