app/controllers/products_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5
---
  def index
	#reset_session

	# get all products
    @products = Product.all
	@order_item = current_order.order_items.new