app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `email`, `cc_number`, `address1`, `order_id`) VALUES ('harish', 'harish.singh@dotsquares.com', '78787878', 'foiha fiasbdfaf', 5)
UPDATE `orders` SET `order_status_id` = 2, `subtotal` = 199.99, `total` = 199.99, `updated_at` = '2016-11-17 15:25:44' WHERE `orders`.`id` = 5
---
	def create

		@order = current_order
		@user = User.new(user_params)
		@user.order_id = @order.id

		if @user.save
			@order.order_status_id = 2
			@order.save