app/views/layouts/_cart_text.html.erb

<%= link_to "#{current_order.order_items.size} Items in Cart ( #{number_to_currency current_order.subtotal, unit:"£"} )", cart_path, class: "btn btn-link" %>
---
SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 5 AND `order_items`.`id` = 8 LIMIT 1
SELECT COUNT(*) FROM `order_items` WHERE `order_items`.`order_id` = 4